 
                                  3/14 Stavi tabl.
prit. Počet.=10    §1/14 ot. tab §2
čekaj  min §3:§4   Stavi tabletu i
pritisni Poč=10     otapanje tablete
min.      §1:§2    Čišćenje
6 X          §1            pričekati
                           
                                  2/14 Čišćenje
aktivno               Čišćenje
aktivno                     
                                  11/14 Presk zad.
kavu DA=1          §1/14 Pon. čist
§2/2 DA=10 NE=ot    1/14 Ruč. četkaj
i pritisni 10      4/14 Grupa kave
se zatvara          5/14 2. ciklus
otap će započ.       §1/14 §2 Čišć.
aktivno §3           Grupa kave u
otvorenoj poz.         14/14 Čiš. grupe
gotovo. 10=Izlaz   §1 Mikser §2
ispiranje              §1 Grupa kave
Ispiranje             Post. početka?
DA=10 NE=8           §1/14 §2 Čišć.
pričekati            12/14 Dostava
kave                  §1/§2 pražnjenje
u tijeku           §1/§2 pov sreds
za kamenac OK=10    §1/§2 punj sreds
za kam u tijeku    §1/§2 voda
teče? DA=10              §1/§2 punj sreds
za kamenac         §1/§2  akcija
sreds=>min §3:§4      §1/§2 drenaža sr
za kam §3/§4       §1/§2 rezultat?
OK=10 NE=DRUGO      §1/§2 spoji
vodu OK=10              §1/§2 punjenje
voda u tijeku        §1/§2 ispiranje
vodom               §1/§2 disp. i
test vodu Y=10        §1/§2 uzmi
vodu za test             §1/§2 uklanj kam
gotovo. IZLAZ=10   §1/§2 otvori
slav bojl Y=10         §1/§2 zatvori
slav bojl Y=10        autom. ispir.
u tijeku              Period. ispir.
u §1 sekunda         Vrsta postupka
RUČ=8 9=NC AU=10      
                                  